package com.javaex.practice;

public class Ex06 {

	public static void main(String[] args) {
		/*
		아래의 설명중 틀린 것을 찾아서 수정해 보세요.
		1.변수한개에는 동시에 여러 개의 값을 담을 수 있다.
		2.변수는 선언시에 사용한 타입의 값만 저장할 수 있다.
		3.변수는 초기값이 저장되지 않아도 읽을 수 있다.
		4.모든 자료형의 변수는 동일한 방식으로 저장된다. 
		5.double형은 flaot보다 큰 수를 담을 수 있다.
		6.int, float, char, String은 모두 기본자료형에 속한다
		7.final로 선언된 변수는 수정이 가능하다
		8.long형은 항상 L을 붙여서 대입해야한다.
		9.float형은 항상 F을 분여서 대입해야한다.
		
		1.한개에 한개만
		3. 변수는 초기값이 저장되지 않은 상태면 읽을 수 없다
		4.기본 자료형
		5.큰 수를 담을 수 있는 것이 아니라 소수점 뒷부분이 더 많고 정확하게 담을 수 있다
		6.String은 기본 자료형이 아니다
		7.수정 불가
		8.int 범위에 포함된 숫자는 안붙여도 되고 포함 안되는 숫자부턴 L을 붙여야함
		*/
		
		
		
		
		
		

	}

}
